Complete Lab Day 09 and Day 10
